app/views/messages/_form.html.erb

      <ul>
      <% @message.errors.full_messages.each do |msg| %>
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`mid` = 'rnraGXufPwAY82VH' LIMIT 1