app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT `messages`.* FROM `messages`

  def play
    @message = Message.find_by_mid(params[:mid])

    respond_to do |format|
      if params[:edit] && @message.user_id == session[:user_id]
        format.html { render :template => 'messages/edit' }
      elsif params[:delete] && @message.user_id == session[:user_id]
        @message.destroy
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`mid` = '45KA3KliiZejAuI1' LIMIT 1
DELETE FROM `messages` WHERE `messages`.`id` = 65

  def my_messages
    # list
    @current_user = current_user
    @message = Message.new
    if @current_user
      @messages = Message.where(:user_id => session[:user_id])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`user_id` = 1 LIMIT 1

  def create
    @message = Message.new(params[:message])

    if session[:user_id]
      @message.user_id = session[:user_id]
    end

    @message.mid = random_string()

    respond_to do |format|
      if @message.save
---
INSERT INTO `messages` (`bg_color`, `created_at`, `message_color`, `text`, `updated_at`, `user_id`) VALUES ('000000', '2012-01-18 16:06:09', 'ffffff', 'test test ', '2012-01-18 16:06:09', NULL)

  def update
    @message = Message.find_by_mid(params[:mid])

    respond_to do |format|
      if @message.user_id == session[:user_id]
        if @message.update_attributes(params[:message])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`mid` = 'rnraGXufPwAY82VH' LIMIT 1
UPDATE `messages` SET `text` = 'test ♥', `updated_at` = '2012-01-19 16:12:30' WHERE `messages`.`id` = 1