app/controllers/sessions_controller.rb

  def create
    # raise request.env["omniauth.auth"].to_yaml

    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO `users` (`created_at`, `email`, `name`, `provider`, `screen_name`, `uid`, `updated_at`) VALUES ('2012-01-21 15:48:16', NULL, 'akipponn', 'twitter', 'akipponn', '3836771', '2012-01-21 15:48:16')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'twitter' AND `users`.`uid` = '3836771' LIMIT 1